# Даны два целых числа A и B (A < B).
# Найти произведение всех целых чисел от A до B включительно
while True:  # Программа постоянно работает даже при ошибке
   try:  # Пользователь ввёл число
       print("Введите 2 числа, где первое меньше второго. ")
       A = int(input("Введите первое число: "))  # Для целочисленных значений
       B = int(input("Введите второе число: "))  # Для целочисленных значений
       if A < B:
           S = 1
           while A - 1 < B:
               S *= A
               A += 1
           print(S)
           print("Спасибо, программа успешно завершена!)")
           break  # Досрочно прерывает цикл
       else:
           print("Вы ввели числа, где A > B, пожалуйста введите заново числа! ")
   except ValueError:  # Проверка исключений(пользователь ввел не числа)
       print("Введите числа, пожалуйста! ")
