# Организовать и вывести последовательность из N случайных целых чисел.
# Из исходной последовательности организовать первую последовательность,
# содержащую четные числа, и вторую – для всех остальных.
# Найти среднее арифметическое в полученных последовательностях.

from random import randint
from statistics import mean

n = [randint(5, 50) for i in range(int(input("Введите количество чисел в последовательности: ")))]
print("Начальный список: ", *n, '\n' + "Список чётных чисел: ", *[x for x in n if x % 2 == 0],
      '\n' + "Среднее арифметическое чётных чисел: ", mean([x for x in n if x % 2 == 0]),
      '\n' + "Список нечётных чисел: ", *[x for x in n if x % 2 != 0], '\n' + "Среднее арифметическое нечётных чисел: ",
      mean([x for x in n if x % 2 != 0]))
