# Дана строка, содержащая полное имя файла, то есть имя диска, список каталогов (путь),
# собственно имя и расширение.
# Выделить из этой строки расширение файла (без предшествующей точки).

s = input("Введите полное имя файла: ")  # Вводим строку
g = ""  # Создаём пустую строку g
for i in range(len(s)):  # Проходим по всей строке s
    g += s[i]  # Добавляет к g каждый элемент строки s
    if s[i] == ".":  # Если элемент строки s равен точке, то..
        g = ""  # ..очищаем строку g
print(f"Расширение у файла: {g}")  # Выводим расширение файла
