#  Дана непустая строка. Вывести коды ее первого и последнего символа.
s = input("Введите строку: ")  # Вводим строку
print(f"Код первого символа {s[0]}: {ord(s[0])}")  # Находим код первого символа с помощью ord
#(возвращает числовое значение для заданного символа)
print(f"Код последнего символа {s[-1]}: {ord(s[-1])}")  # Находим код последнего символа с помощью ord
