# Даны три целых числа: A, B, C.
# Проверить истинность высказывания: "Число B находится между числами A и C"
while True:  # программа будет работать даже при ошибке.
    try:  # пользователь ввёл числа.
        A, B, C = map(int, input("Введите три целых числа:").split())
        if (A > B > C) or (A < B < C):  # проверка числа B на то, стоит ли оно между A и C.
            print("Число", B, "находится между числами", A, "и", C)
            break  # досрочно прерывает цикл
        else:
            print("Число", B, "не находится между числами", A, "и", C)
            break  # досрочно прерывает цикл
    except ValueError:  # проверка исключений(пользователь ввёл не число, на экран выводится текст, а не ошибка)
        print("Введите числа, пожалуйста!")
print("Спасибо, программа успешно завершена!)")
