# Найти сумму чисел ряда 1,2,3,4,... от числа n до числа m.
# Суммирование оформить функцией с параметрами.
# Значения m и n программа должна запрашивать.
def summa():  # Функция, принимающая значения
    n = a
    m = b
    s = 0  # Счётчик
    while n - 1 < m:  # Проходим от числа n до m включительно
        s += n  # Находим сумму от n до m включительно
        n += 1
    return s  # Возвращаем сумму


a = input("Введите первое число: ")

while True:  # Программа работает, даже при ошибке
    try:  # Пользователь ввёл число
        a = int(a)
        break  # Досрочно прерывает цикл
    except ValueError:  # Проверка исключений(пользователь ввел не число)
        print("Введите число, пожалуйста!")
        a = input("Введите первое число: ")

b = input("Введите второе число: ")

while True:  # Программа работает, даже при ошибке
    try:  # Пользователь ввёл число
        b = int(b)
        break  # Досрочно прерывает цикл
    except ValueError:  # Проверка исключений(пользователь ввел не число)
        print("Введите число, пожалуйста!")
        b = input("Введите второе число: ")

print(f"Сумма чисел расположенных между {a} и {b} равно {summa()}")
# Подставляем значения a и b в функцию
print("Спасибо, программа успешно завершена!")
