# Описать функцию AddRightDigit(D, K), добавляющую к целому положительному числу K
# справа цифру D (D - входной параметр целого типа, лежащий в диапазоне 0-9
# K - параметр целого типа, являющийся одновременно входным и выходным).
# С помощью этой функции последовательно дообавить к данному числу K справа
# данные цифры D1 и D2, выводя результат каждого добавления.
def add_right_digit(d, k):  # Функция приписания числа справа
    s = d * 10 + k
    return s  # Возвращаем результат


a = input("Введите K: ")

while True:  # Программа работает, даже при ошибке
    try:  # Пользователь ввёл число
        a = int(a)
        break  # Досрочно прерывает цикл
    except ValueError:  # Проверка исключений(пользователь ввел не число)
        print("Введите число, пожалуйста!")
        a = input("Введите K: ")

d1 = input("Введите D1: ")

while True:  # Программа работает, даже при ошибке
    try:  # Пользователь ввёл число
        d1 = int(d1)
        break  # Досрочно прерывает цикл
    except ValueError:  # Проверка исключений(пользователь ввел не число)
        print("Введите число, пожалуйста!")
        d1 = input("Введите D1: ")
a = add_right_digit(a, d1)  # Заносим в переменную результат первого шага
print(a)

d2 = input("Введите D2: ")

while True:  # Программа работает, даже при ошибке
    try:  # Пользователь ввёл число
        d2 = int(d2)
        break  # Досрочно прерывает цикл
    except ValueError:  # Проверка исключений(пользователь ввел не число)
        print("Введите число, пожалуйста!")
        d2 = input("Введите D2: ")

print(add_right_digit(a, d2))  # Приписываем справа к полученному результату введённое число
print("Спасибо, программа успешно завершена!")
