# Найти сумму чисел ряда 1,2,3,4,... от числа n до числа m.
# Суммирование оформить функцией с параметрами.
# Значения m и n программа должна запрашивать.
def summa():  # Функция, принимающая значения
    n = a
    m = b
    s = 0  # Счётчик
    while n - 1 < m:  # Проходим от числа n до m включительно
        s += n  # Находим сумму от n до m включительно
        n += 1
    return s  # Возвращаем сумму


a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print(f"Сумма чисел расположенных между {a} и {b} равно {summa()}")
# Подставляем значения a и b в функцию
