# Дана масса M в килограммах. Используя операцию деления нацело, найти количество полных тонн в ней (1 тонна = 1000 кг).
m = input()  # вводим массу m
while type(m) != int:  # обработка исключений по типу переменной
    try:  # обработчик исключений
        m = int(m)
    except ValueError:  # проверка исключений(пользователь ввёл не число, на экран выводится текст,а не ошибка)
        print("Вводимое значение должно быть числом")
        m = input()
print(f"Количество полных тонн: {m // 1000}")
